app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "description", "image_url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Sunday Service"], ["description", "Church Services"], ["image_url", nil], ["created_at", "2024-07-14 11:41:03.054219"], ["updated_at", "2024-07-14 11:41:03.054219"], ["user_id", 5]]
---
    def create
      @blog = current_user.blogs.build(blog_params)

      if @blog.save

UPDATE "blogs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "New"], ["description", "Title "], ["updated_at", "2024-07-21 10:11:00.610580"], ["id", 8]]
---
    def update
      if @blog.update(blog_params)