app/controllers/videos_controller.rb

  def create
    @video = current_user.videos.build(video_params)

    if @video.save
---
INSERT INTO "videos" ("title", "description", "video_url", "created_at", "updated_at", "url", "user_id", "blog_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @video.update(video_params)
---
UPDATE "videos" SET "title" = ?, "updated_at" = ?, "url" = ? WHERE "videos"."id" = ?  [["title", "First Tech "], ["updated_at", "2024-07-20 20:17:46.792468"], ["url", "https://youtu.be/BZrGJXBB3jc?feature=shared"], ["id", 1]]